---
kind: property
id: P:Autodesk.Revit.DB.SunAndShadowSettings.ProjectLocationId
source: html/f57ae482-95dd-3398-6997-97199c5bad20.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.ProjectLocationId Property

Identifies the ProjectLocation element used by the SunAndShadowSettings element.

## Syntax (C#)
```csharp
public ElementId ProjectLocationId { get; }
```